# Cleaning the titanic dataset from OpenML

Dataset found on OpenML (https://www.openml.org/d/40945)

In [51]:
import pandas as pd
import numpy as np

In [52]:
columns = ['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'ticket', 'fare', 'cabin', 'embarked']
titanic_raw = pd.read_csv('titanic.csv', usecols=columns)

In [53]:
titanic_raw.insert(0, 'passengerId', value=titanic_raw.index+1)

In [54]:
titanic_raw.head()

,passengerId,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,1,female,29,0,0,24160,211.3375,B5,S
1,2,1,1,male,0.9167,1,2,113781,151.55,C22 C26,S
2,3,1,0,female,2,1,2,113781,151.55,C22 C26,S
3,4,1,0,male,30,1,2,113781,151.55,C22 C26,S
4,5,1,0,female,25,1,2,113781,151.55,C22 C26,S

In [55]:
titanic_raw.describe()

       passengerId       pclass     survived        sibsp        parch
count  1309.000000  1309.000000  1309.000000  1309.000000  1309.000000
mean    655.000000     2.294882     0.381971     0.498854     0.385027
std     378.020061     0.837836     0.486055     1.041658     0.865560
min       1.000000     1.000000     0.000000     0.000000     0.000000
25%     328.000000     2.000000     0.000000     0.000000     0.000000
50%     655.000000     3.000000     0.000000     0.000000     0.000000
75%     982.000000     3.000000     1.000000     1.000000     0.000000
max    1309.000000     3.000000     1.000000     8.000000     9.000000

In [56]:
titanic_raw.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   passengerId  1309 non-null   int64
 1   pclass       1309 non-null   int64
 2   survived     1309 non-null   int64
 3   sex          1309 non-null   object
 4   age          1309 non-null   object
 5   sibsp        1309 non-null   int64
 6   parch        1309 non-null   int64
 7   ticket       1309 non-null   object
 8   fare         1309 non-null   object
 9   cabin        1309 non-null   object
 10  embarked     1309 non-null   object
dtypes: int64(5), object(6)
memory usage: 112.6+ KB

In [57]:
titanic_raw.isna().sum()

passengerId    0
pclass         0
survived       0
sex            0
age            0
sibsp          0
parch          0
ticket         0
fare           0
cabin          0
embarked       0
dtype: int64

## Replacing '?' with np.nan

In [58]:
titanic_raw.replace(to_replace='?', value=np.nan, inplace=True)

In [59]:
titanic_raw.isna().sum()

passengerId       0
pclass            0
survived          0
sex               0
age             263
sibsp             0
parch             0
ticket            0
fare              1
cabin          1014
embarked          2
dtype: int64

## Converting numeric columns from object to floats.

In [60]:
titanic_raw.age.value_counts()

24      47
22      43
21      41
30      40
18      39
        ..
80       1
66       1
20.5     1
76       1
74       1
Name: age, Length: 98, dtype: int64

In [61]:
titanic_raw.age = pd.to_numeric(titanic_raw.age, errors='coerce')

In [62]:
titanic_raw.age.value_counts(dropna=False)

NaN        263
24.0000     47
22.0000     43
21.0000     41
30.0000     40
          ...
24.5000      1
66.0000      1
22.5000      1
23.5000      1
0.6667       1
Name: age, Length: 99, dtype: int64

In [63]:
titanic_raw.fare = pd.to_numeric(titanic_raw.fare, errors='coerce')

In [64]:
titanic_raw.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   passengerId  1309 non-null   int64
 1   pclass       1309 non-null   int64
 2   survived     1309 non-null   int64
 3   sex          1309 non-null   object
 4   age          1046 non-null   float64
 5   sibsp        1309 non-null   int64
 6   parch        1309 non-null   int64
 7   ticket       1309 non-null   object
 8   fare         1308 non-null   float64
 9   cabin        295 non-null    object
 10  embarked     1307 non-null   object
dtypes: float64(2), int64(5), object(4)
memory usage: 112.6+ KB

In [65]:
titanic_raw.describe().T

,count,mean,std,min,25%,50%,75%,max
passengerId,1309.0,655.000000,378.020061,1.0000,328.0000,655.0000,982.000,1309.0000
pclass,1309.0,2.294882,0.837836,1.0000,2.0000,3.0000,3.000,3.0000
survived,1309.0,0.381971,0.486055,0.0000,0.0000,0.0000,1.000,1.0000
age,1046.0,29.881135,14.413500,0.1667,21.0000,28.0000,39.000,80.0000
sibsp,1309.0,0.498854,1.041658,0.0000,0.0000,0.0000,1.000,8.0000
parch,1309.0,0.385027,0.865560,0.0000,0.0000,0.0000,0.000,9.0000
fare,1308.0,33.295479,51.758668,0.0000,7.8958,14.4542,31.275,512.3292

In [67]:
titanic_raw.columns = titanic_raw.columns.str.capitalize()

In [50]:
titanic_raw.to_csv('titanic_clean.csv', index=False)